In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['abhinav','amol','abhishek','anurag'],
    "marks":[87,78,98,67],
    "city":['gkp','kushinagr','fazilnagar','prayagraj']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       name  marks        city
0   abhinav     87         gkp
1      amol     78   kushinagr
2  abhishek     98  fazilnagar
3    anurag     67   prayagraj

In [5]:
df.to_csv('frnd.csv')

In [6]:
df.to_csv('frnd_index_false.csv',index=False)

In [7]:
df.head(2)

      name  marks       city
0  abhinav     87        gkp
1     amol     78  kushinagr

In [8]:
df.tail(2)

       name  marks        city
2  abhishek     98  fazilnagar
3    anurag     67   prayagraj

In [9]:
df.describe()

           marks
count   4.000000
mean   82.500000
std    13.178265
min    67.000000
25%    75.250000
50%    82.500000
75%    89.750000
max    98.000000

In [15]:
abhi = pd.read_csv('Book1.csv')

In [16]:
abhi

   Train no  speed       city
0     12679    123      delhi
1     13980    344        goa
2     12300    325        gkp
3     15000    122  prayagraj
4     12345    232    lucknow

In [17]:
abhi['speed']

0    123
1    344
2    325
3    122
4    232
Name: speed, dtype: int64

In [18]:
abhi['speed'][0]

123

In [19]:
abhi['speed'][0]=198

C:\Users\Muskan Singh\AppData\Local\Temp\ipykernel_16736\1556983139.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  abhi['speed'][0]=198

In [20]:
abhi

   Train no  speed       city
0     12679    198      delhi
1     13980    344        goa
2     12300    325        gkp
3     15000    122  prayagraj
4     12345    232    lucknow

In [22]:
abhi.to_csv('Book1.csv',index=False)

In [26]:
abhi.index = ['first', 'second', 'third', 'fourth','fifth']

In [27]:
abhi

        Train no  speed       city
first      12679    198      delhi
second     13980    344        goa
third      12300    325        gkp
fourth     15000    122  prayagraj
fifth      12345    232    lucknow

In [28]:
ser = pd.Series(np.random.rand)

In [29]:
ser

0    <built-in method rand of numpy.random.mtrand.R...
dtype: object

In [31]:
ser = pd.Series(np.random.rand(30))

In [32]:
ser

0     0.287276
1     0.716169
2     0.541942
3     0.319764
4     0.068013
5     0.064528
6     0.766649
7     0.343889
8     0.091765
9     0.996107
10    0.453695
11    0.694608
12    0.082174
13    0.330733
14    0.314555
15    0.575701
16    0.812438
17    0.567004
18    0.010307
19    0.878820
20    0.579070
21    0.289309
22    0.977515
23    0.416573
24    0.786936
25    0.108939
26    0.233869
27    0.412743
28    0.683382
29    0.394319
dtype: float64

In [33]:
type(ser)

pandas.core.series.Series

In [34]:
newdf = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [35]:
newdf

            0         1         2         3         4
0    0.827434  0.834310  0.912586  0.873162  0.178746
1    0.132217  0.596804  0.974222  0.919711  0.884790
2    0.498704  0.610765  0.686734  0.919629  0.517826
3    0.191565  0.580605  0.491735  0.471335  0.812852
4    0.645839  0.414506  0.612970  0.904684  0.460321
..        ...       ...       ...       ...       ...
329  0.927882  0.030550  0.375910  0.829439  0.659453
330  0.516709  0.916112  0.841661  0.050643  0.250240
331  0.040707  0.756261  0.222748  0.313420  0.419412
332  0.629214  0.530043  0.417179  0.154244  0.151709
333  0.225558  0.073868  0.150800  0.292526  0.836530

[334 rows x 5 columns]

In [36]:
type(newdf)

pandas.core.frame.DataFrame

In [37]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.504356    0.523922    0.485695    0.529469    0.514135
std      0.296752    0.287060    0.288803    0.270948    0.288524
min      0.000144    0.000757    0.000305    0.001744    0.001556
25%      0.224083    0.293713    0.250012    0.315563    0.262034
50%      0.511230    0.514989    0.445295    0.538349    0.537147
75%      0.760767    0.791027    0.741344    0.754984    0.770568
max      0.996205    0.999020    0.999016    0.995046    0.998900

In [40]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [41]:
newdf[0]

0      0.827434
1      0.132217
2      0.498704
3      0.191565
4      0.645839
         ...
329    0.927882
330    0.516709
331    0.040707
332    0.629214
333    0.225558
Name: 0, Length: 334, dtype: float64

In [42]:
newdf[0][0]

0.8274337448486934

In [43]:
newdf[0][0]="abhinav"

C:\Users\Muskan Singh\AppData\Local\Temp\ipykernel_16736\243217777.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'abhinav' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="abhinav"

In [44]:
newdf

            0         1         2         3         4
0     abhinav  0.834310  0.912586  0.873162  0.178746
1    0.132217  0.596804  0.974222  0.919711  0.884790
2    0.498704  0.610765  0.686734  0.919629  0.517826
3    0.191565  0.580605  0.491735  0.471335  0.812852
4    0.645839  0.414506  0.612970  0.904684  0.460321
..        ...       ...       ...       ...       ...
329  0.927882  0.030550  0.375910  0.829439  0.659453
330  0.516709  0.916112  0.841661  0.050643  0.250240
331  0.040707  0.756261  0.222748  0.313420  0.419412
332  0.629214  0.530043  0.417179  0.154244  0.151709
333  0.225558  0.073868  0.150800  0.292526  0.836530

[334 rows x 5 columns]

In [45]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [46]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [47]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [48]:
newdf.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0     abhinav  0.834310  0.912586  0.873162  0.178746
1    0.132217  0.596804  0.974222  0.919711  0.884790
2    0.498704  0.610765  0.686734  0.919629  0.517826
3    0.191565  0.580605  0.491735  0.471335  0.812852
4    0.645839  0.414506  0.612970  0.904684  0.460321
..        ...       ...       ...       ...       ...
329  0.927882  0.030550  0.375910  0.829439  0.659453
330  0.516709  0.916112  0.841661  0.050643  0.250240
331  0.040707  0.756261  0.222748  0.313420  0.419412
332  0.629214  0.530043  0.417179  0.154244  0.151709
333  0.225558  0.073868  0.150800  0.292526  0.836530

[334 rows x 5 columns]>

In [49]:
newdf[0][0]=0.98764

In [51]:
newdf.to_numpy()

array([[0.98764, 0.8343100504230793, 0.9125857116062979,
        0.8731623995151754, 0.17874600901461202],
       [0.13221711341573394, 0.5968044010325633, 0.9742215137629915,
        0.9197105930231331, 0.8847902806628833],
       [0.49870422287588356, 0.6107651195695128, 0.6867338439339118,
        0.9196294196426621, 0.5178257875786445],
       ...,
       [0.040707079410614355, 0.7562609722469288, 0.2227478898338655,
        0.3134200458267581, 0.4194124188406473],
       [0.6292143571975083, 0.5300427594345947, 0.4171785601010711,
        0.15424434647796237, 0.15170924096456595],
       [0.2255576012035202, 0.07386770766128281, 0.15079984178074712,
        0.29252585242148943, 0.8365301594219263]], dtype=object)

In [52]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.98764,0.132217,0.498704,0.191565,0.645839,0.193182,0.251776,0.109782,0.034101,0.657647,...,0.718118,0.68171,0.893597,0.184389,0.60215,0.927882,0.516709,0.040707,0.629214,0.225558
1,0.83431,0.596804,0.610765,0.580605,0.414506,0.58187,0.950641,0.821158,0.000757,0.852819,...,0.365835,0.855496,0.850219,0.223862,0.49585,0.03055,0.916112,0.756261,0.530043,0.073868
2,0.912586,0.974222,0.686734,0.491735,0.61297,0.533543,0.944944,0.305595,0.479686,0.304151,...,0.862269,0.601735,0.086199,0.324371,0.692679,0.37591,0.841661,0.222748,0.417179,0.1508
3,0.873162,0.919711,0.919629,0.471335,0.904684,0.211918,0.093224,0.019363,0.66949,0.445959,...,0.971797,0.265077,0.243137,0.626536,0.26661,0.829439,0.050643,0.31342,0.154244,0.292526
4,0.178746,0.88479,0.517826,0.812852,0.460321,0.905854,0.261956,0.48371,0.574092,0.014738,...,0.823002,0.564216,0.90807,0.433839,0.865499,0.659453,0.25024,0.419412,0.151709,0.83653

In [54]:
newdf

            0         1         2         3         4
0     0.98764  0.834310  0.912586  0.873162  0.178746
1    0.132217  0.596804  0.974222  0.919711  0.884790
2    0.498704  0.610765  0.686734  0.919629  0.517826
3    0.191565  0.580605  0.491735  0.471335  0.812852
4    0.645839  0.414506  0.612970  0.904684  0.460321
..        ...       ...       ...       ...       ...
329  0.927882  0.030550  0.375910  0.829439  0.659453
330  0.516709  0.916112  0.841661  0.050643  0.250240
331  0.040707  0.756261  0.222748  0.313420  0.419412
332  0.629214  0.530043  0.417179  0.154244  0.151709
333  0.225558  0.073868  0.150800  0.292526  0.836530

[334 rows x 5 columns]

In [55]:
newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333  0.225558  0.073868  0.150800  0.292526  0.836530
332  0.629214  0.530043  0.417179  0.154244  0.151709
331  0.040707  0.756261  0.222748  0.313420  0.419412
330  0.516709  0.916112  0.841661  0.050643  0.250240
329  0.927882  0.030550  0.375910  0.829439  0.659453
..        ...       ...       ...       ...       ...
4    0.645839  0.414506  0.612970  0.904684  0.460321
3    0.191565  0.580605  0.491735  0.471335  0.812852
2    0.498704  0.610765  0.686734  0.919629  0.517826
1    0.132217  0.596804  0.974222  0.919711  0.884790
0     0.98764  0.834310  0.912586  0.873162  0.178746

[334 rows x 5 columns]